import { Book } from "./models/models";

const books: Book[] = [
  {
    title: "Мастера и Маргарита",
    author: "Михаил Булгаков",
    date: "2023-10-01",
    price: 350.0,
    tags: ["классика", "роман", "русская литература"],
  },
  {
    title: "1984",
    author: "Джордж Оруэлл",
    date: "2023-08-15",
    price: 450.5,
    tags: ["фантастика", "антиутопия", "политика"],
  },
  {
    title: "Гарри Поттер и философский камень",
    author: "Джоан Роулинг",
    date: "2023-09-20",
    price: 500.0,
    tags: ["фэнтези", "приключения", "для детей"],
  },
  {
    title: "Война и мир",
    author: "Лев Толстой",
    date: "2023-07-10",
    price: 600.75,
    tags: ["классика", "роман", "история"],
  },
  {
    title: "Оно",
    author: "Стивен Кинг",
    date: "2023-06-25",
    price: 400.25,
    tags: ["ужасы", "триллер", "психология"],
  },
  {
    title: "Алхимик",
    author: "Пауло Коэльо",
    date: "2023-05-05",
    price: 350.0,
    tags: ["философия", "поиск себя", "духовность"],
  },
  {
    title: "Приключения Шерлока Холмса",
    author: "Артур Конан Дойл",
    date: "2023-04-15",
    price: 300.0,
    tags: ["детектив", "классика", "приключения"],
  },
  {
    title: "Убить пересмешника",
    author: "Харпер Ли",
    date: "2023-03-12",
    price: 275.0,
    tags: ["роман", "литература", "американская культура"],
  },
  {
    title: "Братья Карамазовы",
    author: "Фёдор Достоевский",
    date: "2023-02-28",
    price: 750.0,
    tags: ["классика", "философия", "психология"],
  },
  {
    title: "Волшебник страны Оз",
    author: "Лаймен Фрэнк Баум",
    date: "2023-01-10",
    price: 180.0,
    tags: ["фэнтези", "классика", "для детей"],
  },
];

export const getBooks = (): Promise<Book[]> => {
  return new Promise((res) => {
    setTimeout(() => res(books), Math.random() * 3000);
  });
};

